{
  "Embeds": {
    "embed": [
      "<title> [description] [colour] [link]",
      "Makes and embed with the specified information.",
      "Makes and embed with the specified information and returns the embed id, which can be used in other embed commands to add to the embed."
    ],
    "add_embed_field": [
      "<embed-id> <name> <value> [inline]",
      "Adds a field to the embed",
      "Adds a field to the embed updating the original embed id with the new information. Inline argumnet is boolean either `True` or `False` and defaults to `False`"
    ],
    "set_embed_thumbnail": [
      "<embed-id> [url]",
      "Sets the thumbnail image to the url.",
      "Takes the image url and adds it as a thumbnail on the original embed id."
    ],
    "send_embed": [
      "<embedid> [delete]",
      "Sends the embed using the embed id.",
      "Sends the specified embed in a message. The `delete` argumnet tells it if it should delete the embed after it is sent, this defaults to `False`."
    ]
  },
  "Moderator": {
    "clear":["[amount]","Clears all messages up to amount in that channel.","Clears all messages up to amount in that channel."],
    "delete_message": [
      "<messageid>",
      "Deletes the specified message.",
      "Deletes the message with the specified id."
    ],
    "kick_member": [
      "<member> [reason]",
      "Kicks the member for the reason.",
      "Kicks the specified member from the server for the given reason."
    ],
    "ban_member": [
      "<member> [reason]",
      "Bans the member for the reason.",
      "Bans the specified member from the server for the given reason."
    ],
    "toggle_word_filter": [
      "",
      "Toggles the word filter on or off.",
      "This commands toggles the word filter to the oposite of its current position. The word filter defaults to off."
    ],
    "set_filter_words": [
      "[word1] [word2] [word3] [word4] [word5]...",
      "Sets the banned words to the arguments.",
      "Sets the banned words to the given arguments. Any number of arguments may be given. This does not change the mode of the word filter."
    ],
    "ban_word": [
      "<word>",
      "Bans the specified word.",
      "Adds the word to the list of banned words. Note: this does not change the mode of the word filter."
    ],
    "unban_word": [
      "<word>",
      "UnBans the specified word.",
      "Removes the word from the list of banned words. Note: this does not change the mode of the word filter."
    ]
  },
  "Sever Settings": {
    "set_rules": [
      "[rule1] [rule2] [rule3] [rule4] [rule5]...",
      "Sets the server rules to the given rules.",
      " Takes all arguments and makes them a list as the new server rules. Use `rules` to get the rules."
    ],
    "set_prefix": [
      "<new_prefix>",
      "Sets the new prefix for the server.",
      "Sets the new prefix for the server. Requires manage_server permissions."
    ],
    "list_server": [
      "",
      "Lists the server on the bot's server list.",
      "Lists the server on the bot's built-in server list. Use `see_servers` to view all servers and invites."
    ],
    "setup_projects": [
      "",
      "Asks a series of questions to set up server project system.",
      "Asks questions for the setup of the server's project channel system. Use `make_project` to make a project."
    ]
  },
  "Common": {
    "blank":[
      "[lines]",
      "Makes a blank message. Used as a seperator between events or other groups.",
      "Makes a blank message. Used as a seperator between events or other groups. Argumnent `lines` refers to the amount of lines the blank messages should take up. Uses hair space."
    ],
    "rules": [
      "",
      "Shows all server rules in an embed.",
      "Shows all server rules in an embed format. Use `set_rules` to set server rules."
    ],
    "rule": [
      "[rulenumber]",
      "Gets a specific server rule.",
      "Gets a specific server rule from the set server rules. rulenumber defaults to -1, -1 shows all rules. Use `set_rules` to set server rules."
    ],
    "see_servers": [
      "[server]",
      "Shows all servers (or specified server).",
      "If server is not specified then all servers are shown. Server is specified by number"
    ],
    "port": [
      "<channelid>",
      "Copies all messages specified channel to channel the message was sent in.",
      "If a message is sent in the given channel, a webhook with the name and avatar of the sender will send the same message in the channel this command was using in. Similar to following announcemnet channels except this is for text channels too and shows sender."
    ],
    "unport":["<channelid>","Removes the port to this channel.","Removes the effect generated by `port`. Removes the port to this channel. "],
    "make_project": [
      "<project_name>",
      "Creates a project channel and role.",
      "Creates a project channel and role using the server's set project channel settings. Use `setup_projects` to set these settings."
    ],
    "bot_invite":["","Sends the bot's invite with 0 permissions.","Sends the bot's invite with 0 permissions."],
    "search": [
      "<query>",
      "Searches for the query. NOTE: IN BETA, results may not be accurate.",
      "NOTE: IN BETA, results may not be accurate. Searches for the query using Search The World V2 API. It will show max 10 results each in their own embed. Includes favicon."
    ]
  }
}
